#Задача 2: Сумма цифр числа.
# n = int(input("Введите число: "))
# sum = 0
# while n > 0:
#     x = n % 10
#     sum = sum + x
#     n = n // 10
# print(sum)
# ---------------------------------------------
# Задача 2. решение через функцию.
# n = int(input("Введите трёхзначное число: "))
# def getSum(n):
#   sum = 0
#   while n != 0:
#       sum = sum + (n % 10)
#       n = n // 10
#   return sum
# print(getSum(n))s
# ---------------------------------------------
# Задача 2. решение с условием трёхзначности числа.
# n = int(input("Введите трёхзначное число: "))
# sum = 0
# while n < 100 or n > 999:
#     n = int(input("Ошибка! Введите трёхзначное число: "))
# while n > 0:
#     sum = sum + (n % 10)
#     n = n // 10
# print(sum)
# ---------------------------------------------
# Задача 4. Журавлики. Вариант 1.
# n = int(input("Введите число: "))
# while n % 6 != 0:
#     n = int(input("Ошибка! Введите правильное число: "))
# p = n//6
# k = p*4
# print("Петя", p, "Катя", k, "Серёжа", p)
# ----------------------------------------------
# Задача 4. Журавлики. Вариант 2.
# n = int(input("Введите число журавликов: ")) // 3
# print("Петя", n // 2, "Катя", n * 2, "Серёжа", n // 2)
# ----------------------------------------------
# Задача 8: Шоколадка.
# n = int(input("Введите размер N: "))
# m = int(input("Введите размер M: "))
# k = int(input("Введите количество K: "))
# if k < m * n and (k % m == 0 or k % n == 0):
#     print(" Да :)")
# else:
#     print(" Нет :(")
# ----------------------------------------------
# Задача 6: Счастливый билет.
# n = input("Введите номер билета: ")
# s1 = int(n[0]) + int(n[1]) + int(n[2])
# s2 = int(n[3]) + int(n[4]) + int(n[5])
# if s1 == s2:
#     print("Счастливый")
# else:
#     print("Обычный")
# ----------------------------------------------
# Задача 6: Счастливый билет. С использованием ф-ций List и map  
# n = int(input("Введите номер билета: "))
# d = list(map(int, list(f'{n:06}')))
# print(('NO', 'YES')[sum(d[:3])==sum(d[3:])])
# ----------------------------------------------
